Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetFailed
queries the connection status
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId,System.String)
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Elements should be of the following structural categories: framings, columns, walls, floors or foundations.
The first of given elements is set as primary one.
This constructor skips informing the addin about type change. SteelElement creation is done before the constructor call
document:
The Revit document.
idsToConnect:
The ElementIdArr containing element id of connected elements.
typeId:
The type of Structural Connection Handler.
extEntId:
The id of the asociated ext entity
Returns:
Returns created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This ElementIdArr is invalid. It should contain ids of the following structural categories: framings, columns, walls, floors or foundations.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetInputReferences
Gets references of input elements.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.SetDefaultElementOrder
Sorts the connected elements connection according to structural categories, element materials and geometries.
The steel element is set rather than an element of other material.
The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors.
In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.SetDefaultPrimaryElement
Sets primary element in connection according to structural categories, element materials and geometries.
The steel element is set rather than an element of other material.
The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors.
In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsCustom
Checks if Structural Connection Handler has the custom connection style.
Returns:
True if Structural Connection Handler has the custom connection style.
Since:
2019

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.IsDetailed
Checks if Structural Connection Handler has the detailed connection style.
Returns:
True if Structural Connection Handler has the detailed connection style.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetOrigin
Retrieves origin point of Structural Connection Handler element.
Returns:
The origin point of element.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetSubPartIds
Gets ids of subpart elements.
After connection regeneration ids may become invalid.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.RemoveReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Removes references from the connection.
All references in an array should belong to the connection.
picks:
The array containing picks to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more picks was not permitted to be removed from the connection.
Picks should be members of the connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.RemoveElementIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Removes element ids from the connection.
All element ids in an array should belong to the connection.
elemIds:
The ElementIdArr containing ids of elements to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be removed from the connection.
Elements should be members of the connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.AddReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds references to the connection.
All references should be of applicable category.
document:
The document.
picks:
The array containing picks of input elements to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more picks was not permitted to be add to the connection.
-or-
One or more picks was not permitted to be added to the connection.
Picks should not be duplicated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.AddElementIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Adds element ids to the connection.
All element ids in an array should be of applicable category.
elemIds:
The ElementIdArr containing ids of elements to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be add to the connection.
Elements should be of applicable category.
-or-
One or more element ids was not permitted to be added to the connection.
Elements should not be duplicated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetConnectedElementIds
Retrieves list of element ids of connected elements.
Returns:
Returns connected element ids.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String)
Creates custom StructuralConnectionHandlerType and StructuralConnectionHandler.
Remarks:
Input Elements are deleted. All the input elements should be of the following structural categories:
FamilyInstance (structural beams and columns).StructuralConnectionHandler elements associated to the connection.Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWeldsOST_StructConnectionHolesOST_StructConnectionModifiersOST_StructConnectionShearStudsOST_StructConnectionBoltsOST_StructConnectionAnchorsOST_StructConnectionPlates
document:
The Document.
elementIds:
Elements which are to be used to create custom StructuralConnectionHandlerType.
typeName:
The StructuralConnectionHandlerType name.
Returns:
The created StructuralConnectionHandler which is of just created custom StructuralConnectionHandlerType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections.
-or-
There must be at least one StructuralConnectionHandler among the input Elements.
Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3.
-or-
Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Elements should be of the following structural categories: framings, columns, walls, floors or foundations.
The first of given elements is set as primary one.
document:
The Revit document.
idsToConnect:
The ElementIdArr containing element id of connected elements.
typeId:
The type of Structural Connection Handler.
Returns:
Returns created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This ElementIdArr is invalid. It should contain ids of the following structural categories: framings, columns, walls, floors or foundations.
-or-
The type typeId is not a valid StructuralConnectionHandlerType.
-or-
Missing detailed structural connection service implementation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Creates a new instance of a Structural Connection Handler, which defines the connection between given elements.
Elements should be of the following structural categories: framings, columns, walls, floors or foundations.
The first of given elements is set as the primary one.
document:
The Revit document.
idsToConnect:
The ElementIdArr containing element id of connected elements.
Returns:
Returns created connection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This ElementIdArr is invalid. It should contain ids of the following structural categories: framings, columns, walls, floors or foundations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.ApprovalTypeId
Retrieves or changes approval type of the Structural Connection Handler.
Name of connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.CodeCheckingStatus
Code checking status of the structural connection.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler.SingleElementEndIndex
Element end index for single element connections (0: start, 1: end).
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: singleElementEndIndex is not a valid end index.
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandler
An object of Structural Connection Handler.
Since:
2017